html/database/5-nosql.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-02-15 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NoSQL</title>
<meta name="author" content="1a2y" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">NoSQL</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org34307f1">1. NoSQL</a></li>
<li><a href="#org061c46b">2. 111</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org34307f1" class="outline-2">
<h2 id="org34307f1"><span class="section-number-2">1.</span> NoSQL</h2>
<div class="outline-text-2" id="text-1">
<p>
名字解释:
</p>
<ol class="org-ol">
<li>No SQL，不是关系型数据库 (SQL, Sqeuence Query Language)</li>
<li>Not Only SQL, 不仅是关系型数据库</li>
</ol>

<p>
NoSQL 数据库:
</p>
<ul class="org-ul">
<li>Redis</li>
<li>MongoDB/CouchDB</li>
<li>HBase</li>
</ul>

<p>
对于数据库存储:
</p>
<ul class="org-ul">
<li>优先使用关系型数据库。一般情况下，已经完全满足需求了</li>
<li>当关系型数据库满足不了你的需求，你就可以寻求 NoSQL 的帮助了</li>
<li>当你有足够内存，并数据的 schema 不是非常确定，MongoDB 是你的最优解</li>
<li>当你追求的唯一是速度而不在乎数据的落地的话，那么 Redis 是那么美</li>
<li>当你有大量、巨量的数据，数据量已经成为了你最大的问题，那么你的选项只有 ElasticSearch/HBase</li>
</ul>

<p>
总之:
</p>
<ul class="org-ul">
<li>MongoDB 可以当做简单场景下的但是性能高数倍的 MySQL</li>
<li>Redis 最适合做缓存</li>
<li>HBase 擅长读写和做离线计算</li>
<li>ElasticSearch 更强于索引和检索</li>
</ul>
</div>
</section>

<section id="outline-container-org061c46b" class="outline-2">
<h2 id="org061c46b"><span class="section-number-2">2.</span> 111</h2>
<div class="outline-text-2" id="text-2">
<p>
skip
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 1a2y</p>
<p class="date">Created: 2023-02-15</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
